base/Enums/бит_ВидыСравненияТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСравненияТрансляции</Name>
			<Comment>Виды сравнения трансляции</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГруппе</Name>
					<Comment>В группе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НЕВГруппе</Name>
					<Comment>НЕ в группе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСодержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГруппеИзСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВГруппеИзСписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_кзн_ЗаявкаНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗаявкаНаРасходованиеСредств</Name>
			<Comment>(БИТ)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийКазначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ДополнительныеУсловияПоДоговору</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленНаСогласование</Name>
					<Comment>Признак того, что работа с документом завершена и он отправлен на согласование. Используется только в режиме "Проводить документы после утверждения".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежиПо275ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСЗаказчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежаФЗ275</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПлатежейФЗ275</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСУчастникомГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПланированияОплатыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбъединятьПозицииПриОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПодтверждающихДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентовПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитовПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациямиПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Catalogs/бит_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатусыОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Порядок следования статусов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Comment>Оформление</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретИзмененияВложений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonModules/бит_ВизированиеУП/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры/функции механизма визирования уникальные для ERP, УТ, КА.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДействияПослеУстановкиСтатуса(Объект, ПараметрыУстановкиСтатуса, КэшОпераций) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	ТипСсылки  = ТипЗнч(Объект.Ссылка);
	Если ТипОбъекта = Тип("ДокументОбъект.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда
		Если ПараметрыУстановкиСтатуса.ВнешняяУстановкаСтатуса Тогда
			СсылкаНаОбъект = Объект.Ссылка;
			РезультатПоискаПоз  = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(СсылкаНаОбъект);
			РезультатПоискаПост = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(СсылкаНаОбъект);
				
			ПозицияОб = РезультатПоискаПоз.Позиция.ПолучитьОбъект();
			бит_ВизированиеСервер.УстановитьСтатус(ПозицияОб);
			ПоступлениеОб = РезультатПоискаПост.Позиция.ПолучитьОбъект();
			бит_ВизированиеСервер.УстановитьСтатус(ПоступлениеОб);
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		Если ПараметрыУстановкиСтатуса.ВнешняяУстановкаСтатуса Тогда
			СсылкаНаОбъект  = Объект.Ссылка;
			РезультатПоиска = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(СсылкаНаОбъект);
			Для каждого Позиция Из РезультатПоиска.МассивПозиций Цикл
				ПозицияОб = Позиция.ПолучитьОбъект();
				бит_ВизированиеСервер.УстановитьСтатус(ПозицияОб);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
		Если ПараметрыУстановкиСтатуса.ВнешняяУстановкаСтатуса Тогда
			СсылкаНаОбъект  = Объект.Ссылка;
			РезультатПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(СсылкаНаОбъект);
			Для каждого Позиция Из РезультатПоиска.МассивПозиций Цикл
				ПозицияОб = Позиция.ПолучитьОбъект();
				бит_ВизированиеСервер.УстановитьСтатус(ПозицияОб);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.бит_кзн_ПлатежнаяПозиция") Тогда
		Документы.бит_кзн_ПлатежнаяПозиция.ОбновитьСтатусыСвязанныхРеестров(Объект.Ссылка);
	ИначеЕсли Метаданные.ОпределяемыеТипы.бит_ДоговорыКонтрагентов.Тип.СодержитТип(ТипСсылки) Тогда
		Объект.ДополнительныеСвойства.Вставить("ОтключитьОпределениеСтатуса", Истина);
		УстановитьСтатусДоговораПоСтатусуВизирования(Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьКонтекстПользовательскогоУсловия(ПользовательскоеУсловие, СтруктураКонтекст) Экспорт
	
	КодУсловия = ПользовательскоеУсловие.КодУсловия;
	
	Если ТипЗнч(СтруктураКонтекст.ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда		
		   
		Если НЕ СтруктураКонтекст.Свойство("ОплатаЗаявки") Тогда
			СтруктураОплат = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПолучитьОплатыПоПозиции(СтруктураКонтекст.ТекущийОбъект.Ссылка);
			СтруктураКонтекст.Вставить("ОплатаЗаявки",СтруктураОплат);
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(СтруктураКонтекст.ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления") Тогда		
		
		СтруктураОплат = Документы.бит_кзн_ПозицияПоступления.СтруктураОплатыПоПозиции(СтруктураКонтекст.ТекущийОбъект.Ссылка);
		Если НЕ СтруктураКонтекст.Свойство("ОплатаЗаявки") Тогда
			СтруктураКонтекст.Вставить("ОплатаЗаявки",СтруктураОплат);
		КонецЕсли;
		Если НЕ СтруктураКонтекст.Свойство("ОплатаПоступления") Тогда
			СтруктураКонтекст.Вставить("ОплатаПоступления",СтруктураОплат);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СтруктураКонтекст.ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		
		Если НЕ СтруктураКонтекст.Свойство("ОплатаЗаявки") Тогда
			СтруктураОплат = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПолучитьОплатыПоЗаявке(СтруктураКонтекст.ТекущийОбъект.Ссылка);
			СтруктураКонтекст.Вставить("ОплатаЗаявки",СтруктураОплат);
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(СтруктураКонтекст.ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств")
		ИЛИ ТипЗнч(СтруктураКонтекст.ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда
		
		Если НЕ СтруктураКонтекст.Свойство("ОплатаЗаявки") Тогда
			СтруктураОплат = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.СтруктураОплатыПоЗаявкеНаПеремещение(СтруктураКонтекст.ТекущийОбъект.Ссылка);
			СтруктураКонтекст.Вставить("ОплатаЗаявки",СтруктураОплат);
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(СтруктураКонтекст.ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
		
		Если НЕ СтруктураКонтекст.Свойство("ОплатаПоступления") Тогда			
			СтруктураОплат = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ПолучитьОплатыПоПоступлению(СтруктураКонтекст.ТекущийОбъект.Ссылка);
			СтруктураКонтекст.Вставить("ОплатаПоступления",СтруктураОплат);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СтруктураКонтекст.ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты") Тогда
		
		Если НЕ СтруктураКонтекст.Свойство("ПланируемыеЗатраты") Тогда			
			ПланируемыеЗатраты = Документы.бит_пз_ЗаявкаНаЗатраты.ПолучитьОстаткиДляУстановкиСтатуса(СтруктураКонтекст.ТекущийОбъект.Ссылка);
			СтруктураКонтекст.Вставить("ПланируемыеЗатраты", ПланируемыеЗатраты);
		КонецЕсли;
				
    КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПозициюПользовательскогоУсловия(РезультатПроверкиПозиций, СтрокаУсловия, СтруктураКонтекст) Экспорт
	
	РезультатУсловия  = Ложь;
	ОбъектПроверки    = СтруктураКонтекст.ТекущийОбъект.Ссылка;
	ЛевоеПоле         = СтрокаУсловия.Свойство;
	ЗначениеСравнения = ЗначениеПоляСравнения(СтрокаУсловия, СтруктураКонтекст);
	
	Если СтрНачинаетсяС(ЛевоеПоле, "ЗначениеЗаполнено(РеквизитыПозиции.")
		И СтрЗаканчиваетсяНа(ЛевоеПоле, ")") Тогда
		Поле = СтрЗаменить(ЛевоеПоле, "ЗначениеЗаполнено(РеквизитыПозиции.", "");
		Поле = Лев(Поле, СтрДлина(Поле) - 1);
		ЗначенияПоляПозиций = ЗначенияПоляПозиций(ОбъектПроверки, Поле);
		ЗаполненоЗначение   = Ложь;
		Для каждого ЗначениеПоля Из ЗначенияПоляПозиций Цикл
			Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
				ЗаполненоЗначение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтрокаУсловия.ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НеРавно Тогда
			РезультатУсловия = (ЗаполненоЗначение <> ЗначениеСравнения);
		Иначе
			РезультатУсловия = (ЗаполненоЗначение = ЗначениеСравнения);
		КонецЕсли;
	Иначе
		Поле             = СтрЗаменить(ЛевоеПоле, "РеквизитыПозиции.", "");
		РезультатУсловия = УловиеПозицииВыполнено(ОбъектПроверки, Поле, СтрокаУсловия.ВидСравнения, ЗначениеСравнения);
	КонецЕсли;
	РезультатПроверкиПозиций.Вставить(СтрокаУсловия.ИД, РезультатУсловия);
	
КонецПроцедуры

Процедура ПользовательскоеУсловиеПозицияСодержитЗначение(РезультатыПроверок, ПользовательскоеУсловие, СтрокаТаблицы, СтруктураКонтекст) Экспорт
	
	ИмяРеквизита = Справочники.бит_ПользовательскиеУсловия.ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий,
																					СтрокаТаблицы.ИД,
																					"ИмяРеквизита",
																					"UnrealAttribute");
	ПроверяемоеЗначение = Справочники.бит_ПользовательскиеУсловия.ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий,
																					СтрокаТаблицы.ИД,
																					"Значение",
																					Неопределено);
	СодержитЗначение = ПозицияСодержитЗначение(СтруктураКонтекст.ТекущийОбъект, ИмяРеквизита, ПроверяемоеЗначение);												
	РезультатыПроверок.Вставить(СтрокаТаблицы.ИД, СодержитЗначение);
	
КонецПроцедуры

// Функция определяет, есть ли в позициях документа 
// планирования указанные значения указанного реквизита.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект, ДокументСсылка 
//  ИмяРеквизита - Строка
//  ТекущееЗначение - Произвольный
//
// Возвращаемое значение:
//  Результат - Строка.
//
Функция ПозицияСодержитЗначение(ТекущийОбъект, ИмяРеквизита, ТекущееЗначение) Экспорт
	
	Если ТекущийОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТекущееЗначение"     , ТекущееЗначение);
	
	Если ТипЗнч(ТекущийОбъект) = Тип("ДанныеФормыСтруктура") Тогда
		ИмяОбъекта = ТекущийОбъект.Ссылка.Метаданные().Имя;
	Иначе
		ИмяОбъекта = ТекущийОбъект.Метаданные().Имя;
	КонецЕсли; 
	
	ТекстЗапроса = "";
	Если ИмяОбъекта = Метаданные.Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.Имя
		ИЛИ ИмяОбъекта = Метаданные.Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.Имя Тогда
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, Метаданные.Документы.бит_кзн_ПлатежнаяПозиция) 
			И бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, Метаданные.Документы.бит_кзн_ПозицияПоступления) Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	бит_кзн_ПлатежнаяПозиция.Ссылка
			|ИЗ
			|	Документ.бит_кзн_ПлатежнаяПозиция КАК бит_кзн_ПлатежнаяПозиция
			|ГДЕ
			|	бит_кзн_ПлатежнаяПозиция.ДокументПланирования = &ДокументПланирования
			|	И НЕ бит_кзн_ПлатежнаяПозиция.ПометкаУдаления
			|	И бит_кзн_ПлатежнаяПозиция.%1 = &ТекущееЗначение
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	бит_кзн_ПозицияПоступления.Ссылка
			|ИЗ
			|	Документ.бит_кзн_ПозицияПоступления КАК бит_кзн_ПозицияПоступления
			|ГДЕ
			|	бит_кзн_ПозицияПоступления.ДокументПланирования = &ДокументПланирования
			|	И НЕ бит_кзн_ПозицияПоступления.ПометкаУдаления
			|	И бит_кзн_ПозицияПоступления.%1 = &ТекущееЗначение";
			
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита);
			
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ИмяОбъекта = Метаданные.Документы.бит_кзн_ПлатежнаяПозиция.Имя Тогда
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, Метаданные.Документы.бит_кзн_ПлатежнаяПозиция) Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	бит_кзн_ПлатежнаяПозиция.Ссылка
			|ИЗ
			|	Документ.бит_кзн_ПлатежнаяПозиция КАК бит_кзн_ПлатежнаяПозиция
			|ГДЕ
			|	бит_кзн_ПлатежнаяПозиция.Ссылка = &ДокументПланирования
			|	И бит_кзн_ПлатежнаяПозиция.%1 = &ТекущееЗначение";
			
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита);
			
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ИмяОбъекта = Метаданные.Документы.бит_кзн_ПозицияПоступления.Имя Тогда
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, Метаданные.Документы.бит_кзн_ПозицияПоступления) Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	бит_кзн_ПозицияПоступления.Ссылка
			|ИЗ
			|	Документ.бит_кзн_ПозицияПоступления КАК бит_кзн_ПозицияПоступления
			|ГДЕ
			|	бит_кзн_ПозицияПоступления.Ссылка = &ДокументПланирования
			|	И бит_кзн_ПозицияПоступления.%1 = &ТекущееЗначение";
			
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита);
			
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе	
		
		ИмяПоз = ИмяПозиций(ИмяОбъекта);
		МетаПозиция = Метаданные.Документы[ИмяПоз];
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаПозиция) Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Позициии.Ссылка
			|ИЗ
			|	Документ.%1 КАК Позициии
			|ГДЕ
			|	Позициии.ДокументПланирования = &ДокументПланирования
			|	И Позициии.%2 = &ТекущееЗначение";
			
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяПоз, ИмяРеквизита);
			
		Иначе	
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	
	Запрос.Текст     = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

Процедура ПользовательскоеУсловиеПозицияСодержитЗначениееВГруппе(РезультатыПроверок, ПользовательскоеУсловие, СтрокаТаблицы, СтруктураКонтекст) Экспорт
	
	ИмяРеквизита        = Справочники.бит_ПользовательскиеУсловия.ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий,
																							СтрокаТаблицы.ИД,
																							"ИмяРеквизита",
																							"UnrealAttribute");
	ПроверяемоеЗначение = Справочники.бит_ПользовательскиеУсловия.ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий,
																							СтрокаТаблицы.ИД,
																							"Значение",
																							Неопределено);
	СодержитЗначение    = ПозицияСодержитЗначениеВГруппе(СтруктураКонтекст.ТекущийОбъект, ИмяРеквизита, ПроверяемоеЗначение);												
	РезультатыПроверок.Вставить(СтрокаТаблицы.ИД, СодержитЗначение);
	
КонецПроцедуры

Процедура ПользовательскоеУсловиеСуммаПозиций(РезультатыПроверок, СтрокаТаблицы, СтруктураКонтекст) Экспорт
	
	ТекущийОбъект = СтруктураКонтекст.ТекущийОбъект;
	СуммаПозиций  = 0;
	
	ИмяОбъекта = ТекущийОбъект.Метаданные().Имя;
	ИмяПоз = ИмяПозиций(ИмяОбъекта);	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ДокументПланирования", ТекущийОбъект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(бит_кзн_ПлатежнаяПозиция.СуммаДокумента) КАК СуммаДокумента
	|ИЗ
	|	#Таблица КАК бит_кзн_ПлатежнаяПозиция
	|ГДЕ
	|	бит_кзн_ПлатежнаяПозиция.ДокументПланирования = &ДокументПланирования
	|	И НЕ бит_кзн_ПлатежнаяПозиция.ПометкаУдаления";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"#Таблица", СтрШаблон("Документ.%1",ИмяПоз));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СуммаПозиций = ?(ТипЗнч(Выборка.СуммаДокумента) = Тип("Число"), Выборка.СуммаДокумента, 0);
	КонецЕсли; 
	
	РезультатыПроверок.Вставить(СтрокаТаблицы.ИД, СуммаПозиций);
	
КонецПроцедуры

// Функция определяет имя позиции по имени объекта.
//
// Параметры:
//  ИмяОбъекта - строка
//
// Возвращаемое значение:
//  ИмяПоз - Строка.
//
Функция ИмяПозиций(ИмяОбъекта) Экспорт
	
	Если ИмяОбъекта = Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.Имя Тогда
		ИмяПоз = Метаданные.Документы.бит_кзн_ПлатежнаяПозиция.Имя;
	ИначеЕсли ИмяОбъекта = Метаданные.Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Имя Тогда
		ИмяПоз = Метаданные.Документы.бит_кзн_ПозицияПоступления.Имя;
	Иначе	
		ИмяПоз = Метаданные.Документы.бит_кзн_ПозицияПоступления.Имя;
	КонецЕсли; 
	
	Возврат ИмяПоз;
	
КонецФункции

Процедура ЗаполнитьОбъектыСистемыВПоставляемыхГруппах(ТаблицаОбъектов) Экспорт
	
	Менеджер = Справочники.бит_СтатусыОбъектов;
	
	Менеджер.ДобавитьВОбъектыСистемы(Менеджер.СтатусыРеестраПлатежей,
									Метаданные.Документы.бит_кзн_РеестрПлатежей,
									ТаблицаОбъектов);
	Менеджер.ДобавитьВОбъектыСистемы(Менеджер.СтатусыДоговорыКонтрагентов,
									Метаданные.Справочники.ДоговорыКонтрагентов,
									ТаблицаОбъектов);
	Менеджер.ДобавитьВОбъектыСистемы(Менеджер.СтатусыЗаявкиНаЗатраты,
									Метаданные.Документы.бит_пз_ЗаявкаНаЗатраты,
									ТаблицаОбъектов);
	Менеджер.ДобавитьВОбъектыСистемы(Менеджер.СтатусыЗаявкиНаПеремещениеДС,
									Метаданные.Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств,
									ТаблицаОбъектов);
	Менеджер.ДобавитьВОбъектыСистемы(Менеджер.СтатусыЗаявкиНаРасходованиеСредств,
									Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств,
									ТаблицаОбъектов);
	Менеджер.ДобавитьВОбъектыСистемы(Менеджер.СтатусыПланируемоеПоступлениеДС,
									Метаданные.Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств,
									ТаблицаОбъектов);
	Менеджер.ДобавитьВОбъектыСистемы(Менеджер.СтатусыСводнойЗаявкиНаЗатраты,
									Метаданные.Документы.бит_пз_СводнаяЗаявкаНаЗатраты,
									ТаблицаОбъектов);
	Менеджер.ДобавитьВОбъектыСистемы(Менеджер.СтатусыЗаявкиНаПереводСредствВДругуюОрганизацию, 
									Метаданные.Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию,
									ТаблицаОбъектов);
	
КонецПроцедуры

Функция АктуальныеСтатусыДляЗамены() Экспорт
	
	МенеджерСтатусов = Справочники.бит_СтатусыОбъектов;
	
	ПарыЗамен = Новый Соответствие;
	
	Возврат ПарыЗамен;
	
КонецФункции

Функция СоздатьДоговорВСтатусеУтвержден(Объект) Экспорт
	
	// Функционал доступен в БП.
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьВизыПоУмолчанию(ТаблицаВиз) Экспорт
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "ДокументПроверен";
	НоваяВиза.Наименование = НСтр("ru='Документ проверен';en='Document verified'");
	НоваяВиза.Литера       = "П";
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "ДокументУтвержден";
	НоваяВиза.Наименование = НСтр("ru='Документ утвержден';en='Document approved'");
	НоваяВиза.Литера       = "У";
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "Казначей";
	НоваяВиза.Наименование = НСтр("ru='Казначей';en='Paymaster'");
	НоваяВиза.Литера       = "К";
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "НалоговыйИнспектор";
	НоваяВиза.Наименование = НСтр("ru='Налоговый инспектор';en='Tax inspector'");
	НоваяВиза.Литера       = "Н";
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "ОтветственныйНСИ";
	НоваяВиза.Наименование = НСтр("ru='Ответственный НСИ';en='Responsible RBI'");
	НоваяВиза.Литера       = "О";
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "РуководительЦФО";
	НоваяВиза.Наименование = НСтр("ru='Руководитель ЦФО';en='Head of the CFD'");
	НоваяВиза.Литера       = "Р";
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "СверхБюджета";
	НоваяВиза.Наименование = НСтр("ru='Сверх бюджета';en='Over budget'");
	НоваяВиза.Литера       = "С";
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "СпециалистМДМ";
	НоваяВиза.Наименование = НСтр("ru='Специалист МДМ';en='MDM Specialist'");
	НоваяВиза.Литера       = "С";
	
	НоваяВиза = ТаблицаВиз.Добавить();
	НоваяВиза.КлючВизы     = "ФинансовыйДиректор";
	НоваяВиза.Наименование = НСтр("ru='Финансовый директор';en='CFO'");
	НоваяВиза.Литера       = "Ф";
	
КонецПроцедуры

Процедура ЗаполнитьАлгоритмыПоУмолчанию(ДеревоАлгоримтов) Экспорт
	
	МетаданныеДокументы = Метаданные.Документы;
	
	МетаданныеОбъекта = МетаданныеДокументы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию;
	СтрокаОбъекта = ДеревоАлгоримтов.Строки.Добавить();
	СтрокаОбъекта.ОбъектКлючВизы = МетаданныеОбъекта;
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "Казначей";
	
	МетаданныеОбъекта = МетаданныеДокументы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств;
	СтрокаОбъекта = ДеревоАлгоримтов.Строки.Добавить();
	СтрокаОбъекта.ОбъектКлючВизы = МетаданныеОбъекта;
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "Казначей";
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "ФинансовыйДиректор";
	
	МетаданныеОбъекта = МетаданныеДокументы.бит_кзн_ЗаявкаНаРасходованиеСредств;
	СтрокаОбъекта = ДеревоАлгоримтов.Строки.Добавить();
	СтрокаОбъекта.ОбъектКлючВизы = МетаданныеОбъекта;
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "Казначей";
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "ФинансовыйДиректор";
	
	МетаданныеОбъекта = МетаданныеДокументы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств;
	СтрокаОбъекта = ДеревоАлгоримтов.Строки.Добавить();
	СтрокаОбъекта.ОбъектКлючВизы = МетаданныеОбъекта;
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "Казначей";
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "ФинансовыйДиректор";
	
	МетаданныеОбъекта = МетаданныеДокументы.бит_мдм_ЗаявкаНаИзменение;
	СтрокаОбъекта = ДеревоАлгоримтов.Строки.Добавить();
	СтрокаОбъекта.ОбъектКлючВизы = МетаданныеОбъекта;
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "ОтветственныйНСИ";
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "СпециалистМДМ";
	
	МетаданныеОбъекта = МетаданныеДокументы.бит_мдм_ЗаявкаНаУдаление;
	СтрокаОбъекта = ДеревоАлгоримтов.Строки.Добавить();
	СтрокаОбъекта.ОбъектКлючВизы = МетаданныеОбъекта;
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "ОтветственныйНСИ";
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "СпециалистМДМ";
	
	МетаданныеОбъекта = МетаданныеДокументы.Найти("бит_ОтветНаЗапросНалоговогоМониторинга");
	Если МетаданныеОбъекта <> Неопределено Тогда
		СтрокаОбъекта = ДеревоАлгоримтов.Строки.Добавить();
		СтрокаОбъекта.ОбъектКлючВизы = МетаданныеОбъекта;
		СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
		СтрокаВизы.ОбъектКлючВизы = "НалоговыйИнспектор";
	КонецЕсли;
	
	МетаданныеСтандартныхАлгоритмов = Новый Массив;
	МетаданныеСтандартныхАлгоритмов.Добавить(МетаданныеДокументы.бит_АктуализацияБюджета);
	МетаданныеСтандартныхАлгоритмов.Добавить(МетаданныеДокументы.бит_БюджетнаяОперация);
	МетаданныеСтандартныхАлгоритмов.Добавить(МетаданныеДокументы.бит_ДополнительныеУсловияПоДоговору);
	МетаданныеСтандартныхАлгоритмов.Добавить(МетаданныеДокументы.бит_кзн_РеестрПлатежей);
	МетаданныеСтандартныхАлгоритмов.Добавить(МетаданныеДокументы.бит_КорректировкаБюджета);
	МетаданныеСтандартныхАлгоритмов.Добавить(МетаданныеДокументы.бит_КорректировкаКонтрольныхЗначений);
	МетаданныеСтандартныхАлгоритмов.Добавить(МетаданныеДокументы.бит_ПротоколРасхожденийБюджета);
	МетаданныеСтандартныхАлгоритмов.Добавить(МетаданныеДокументы.бит_ФормаВводаБюджета);
	МетаданныеСтандартныхАлгоритмов.Добавить(Метаданные.Справочники.бит_ВнутренниеДокументы);
	Для каждого МетаданныеОбъекта Из МетаданныеСтандартныхАлгоритмов Цикл
		ДобавитьСтандартныйАлгоритмПроверенУтвержден(ДеревоАлгоримтов, МетаданныеОбъекта);
	КонецЦикла;
	
КонецПроцедуры

Функция ОбъектыВизированияОтлюченныеПоУмолчанию() Экспорт
	
	ОтключенныеОбъекты = Новый Массив;
	Если НЕ Константы.бит_УдалитьИспользоватьВизированиеДляДоговоров.Получить() Тогда
		// После удаления константы, заполнять этот перечень всегда (договора по умолчанию не визируются).
		Для каждого ТипДоговора Из Метаданные.ОпределяемыеТипы.бит_ДоговорыКонтрагентов.Тип.Типы() Цикл
			ОтключенныеОбъекты.Добавить(Метаданные.НайтиПоТипу(ТипДоговора).ПолноеИмя());
		КонецЦикла;
		ОтключенныеОбъекты.Добавить(Метаданные.Справочники.СоглашенияСКлиентами.ПолноеИмя());
		ОтключенныеОбъекты.Добавить(Метаданные.Справочники.СоглашенияСПоставщиками.ПолноеИмя());
	КонецЕсли;
	
	Возврат ОтключенныеОбъекты;
	
КонецФункции

Процедура ПриНачальномЗаполненииСтатусовОбъектов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	#Область СтатусыДоговорыКонтрагентов
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Справочники.ДоговорыКонтрагентов);

	#КонецОбласти
	
	#Область СтатусыЗаявкиНаЗатраты
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_пз_ЗаявкаНаЗатраты);

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных	= "ЗаявкаНаЗатраты_ВключенаВСводнуюЗаявку";
	Элемент.Родитель					= Справочники.бит_СтатусыОбъектов.СтатусыЗаявкиНаЗатраты;
	Элемент.Наименование				= НСтр("ru = 'Включена в сводную заявку'; en = 'Consolidated'", КодОсновногоЯзыка);
	Элемент.Код							= "000000153";
	Элемент.Порядок						= 3;
	Элемент.Объект						= ОбъектСистемы;
	Элемент.ЗапретИзмененияВложений		= Ложь;
	Элемент.ТипСтатуса					= Перечисления.бит_ТипыСтатусовОбъектов.Прочее;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных	= "ЗаявкаНаЗатраты_Исполнена";
	Элемент.Родитель					= Справочники.бит_СтатусыОбъектов.СтатусыЗаявкиНаЗатраты;
	Элемент.Наименование				= НСтр("ru = 'Исполнена'; en = 'Executed'", КодОсновногоЯзыка);
	Элемент.Код							= "000000143";
	Элемент.Порядок						= 2;
	Элемент.Объект						= ОбъектСистемы;
	Элемент.ЗапретИзмененияВложений		= Ложь;
	Элемент.ТипСтатуса					= Перечисления.бит_ТипыСтатусовОбъектов.Исполнен;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных	= "ЗаявкаНаЗатраты_ЧастичноИсполнена";
	Элемент.Родитель					= Справочники.бит_СтатусыОбъектов.СтатусыЗаявкиНаЗатраты;
	Элемент.Наименование				= НСтр("ru = 'Частично исполнена'; en = 'Partially executed'", КодОсновногоЯзыка);
	Элемент.Код							= "000000144";
	Элемент.Порядок						= 1;
	Элемент.Объект						= ОбъектСистемы;
	Элемент.ЗапретИзмененияВложений		= Ложь;
	Элемент.ТипСтатуса					= Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен;
	
	#КонецОбласти
	
	#Область СтатусыЗаявкиНаРасходованиеСредств
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыЗаявкиНаРасходованиеСредств;
	Элемент.ИмяПредопределенныхДанных = "Заявка_ВРеестре";
	Элемент.Наименование              = НСтр("ru='В реестре';en='In registry'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000162";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.ВРеестре;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СтатусыСводнойЗаявкиНаЗатраты
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_пз_СводнаяЗаявкаНаЗатраты);

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных	= "СводнаяЗаявкаНаЗатраты_Исполнена";
	Элемент.Родитель					= Справочники.бит_СтатусыОбъектов.СтатусыСводнойЗаявкиНаЗатраты;
	Элемент.Наименование				= НСтр("ru = 'Исполнена'; en = 'Executed'", КодОсновногоЯзыка);
	Элемент.Код							= "000000151";
	Элемент.Порядок						= 2;
	Элемент.Объект						= ОбъектСистемы;
	Элемент.ЗапретИзмененияВложений		= Ложь;
	Элемент.ТипСтатуса					= Перечисления.бит_ТипыСтатусовОбъектов.Исполнен;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных	= "СводнаяЗаявкаНаЗатраты_ЧастичноИсполнена";
	Элемент.Родитель					= Справочники.бит_СтатусыОбъектов.СтатусыСводнойЗаявкиНаЗатраты;
	Элемент.Наименование				= НСтр("ru = 'Частично исполнена'; en = 'Partially executed'", КодОсновногоЯзыка);
	Элемент.Код							= "000000152";
	Элемент.Порядок						= 1;
	Элемент.Объект						= ОбъектСистемы;
	Элемент.ЗапретИзмененияВложений		= Ложь;
	Элемент.ТипСтатуса					= Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен;
	
	#КонецОбласти
	
КонецПроцедуры

Функция НеВыполнятьПроверкуСтатусаДляОбъекта(Объект)Экспорт
	
	ТипСсылки = ТипЗнч(Объект.Ссылка);
	Если Метаданные.ОпределяемыеТипы.бит_ДоговорыКонтрагентов.Тип.СодержитТип(ТипСсылки)
		ИЛИ ТипСсылки = Тип("СправочникСсылка.СоглашенияСКлиентами")
		ИЛИ ТипСсылки = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеПоляСравнения(СтрокаУсловия, СтруктураКонтекст)
	
	ЗначениеСравнения = СтруктураКонтекст.ЗначенияПользовательскихУсловий.Получить(СтрокаУсловия.ИД);
	Если ТипЗнч(ЗначениеСравнения) = Тип("Строка") Тогда
		Если СтрСравнить(ЗначениеСравнения, "Прочее.ТекущийПользователь") = 0 Тогда
			ЗначениеСравнения = СтруктураКонтекст.Прочее.ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеСравнения;
	
КонецФункции

Функция ЗначенияПоляПозиций(ДокументПланирования, Поле)
	
	ЗначенияПоля = Новый Массив;
	
	ТипДокумента  = ТипЗнч(ДокументПланирования);
	МетаДокументы = Метаданные.Документы;
	
	СтекПутиРеквизита = СтрРазделить(Поле, ".");
	Если СтекПутиРеквизита.Количество() = 0 Тогда
		Возврат ЗначенияПоля;
	КонецЕсли;
	ИмяПоляРеквизита = СтекПутиРеквизита[0];
	
	ЭтоПлатежнаяПозиция         = (ТипДокумента = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция"));
	ЭтоПозицияПоступления       = (ТипДокумента = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления"));
									
	РеквизитыПозиции = МетаДокументы.бит_кзн_ПлатежнаяПозиция.Реквизиты;
	ПроверятьПлатежныеПозиции   = ЭтоПлатежнаяПозиция
									ИЛИ РеквизитыПозиции.ДокументПланирования.Тип.СодержитТип(ТипДокумента)
									И (РеквизитыПозиции.Найти(ИмяПоляРеквизита) <> Неопределено);
	РеквизитыПозиции = МетаДокументы.бит_кзн_ПозицияПоступления.Реквизиты;
	ПроверятьПозицииПоступления = ЭтоПозицияПоступления
									ИЛИ РеквизитыПозиции.ДокументПланирования.Тип.СодержитТип(ТипДокумента)
									И (РеквизитыПозиции.Найти(ИмяПоляРеквизита) <> Неопределено);
									
	Если НЕ ПроверятьПлатежныеПозиции И НЕ ПроверятьПозицииПоступления Тогда
		Возврат ЗначенияПоля;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если ПроверятьПлатежныеПозиции И ПроверятьПозицииПоступления Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПлатежныеПозиции.Комментарий КАК Ссылка
		|ИЗ
		|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
		|ГДЕ
		|	ПлатежныеПозиции.ДокументПланирования = &ДокументПланирования
		|		ИЛИ ПлатежныеПозиции.Ссылка = &ДокументПланирования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПозицияПоступления.Комментарий
		|ИЗ
		|	Документ.бит_кзн_ПозицияПоступления КАК ПозицияПоступления
		|ГДЕ
		|	ПозицияПоступления.ДокументПланирования = &ДокументПланирования
		|		ИЛИ ПозицияПоступления.Ссылка = &ДокументПланирования";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДокументыПозиции.Комментарий КАК Ссылка
		|ИЗ
		|	&ДокументыПозиции КАК ДокументыПозиции
		|ГДЕ
		|	ДокументыПозиции.ДокументПланирования = &ДокументПланирования";
		ДокументПозиции = ?(ПроверятьПлатежныеПозиции, "Документ.бит_кзн_ПлатежнаяПозиция",
							"Документ.бит_кзн_ПозицияПоступления");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументыПозиции", ДокументПозиции);
		Если ЭтоПлатежнаяПозиция ИЛИ ЭтоПозицияПоступления Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
							"ДокументыПозиции.ДокументПланирования",
							"ДокументыПозиции.Ссылка");
		КонецЕсли;
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".Комментарий", "." + Поле);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументПланирования);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗначенияПоля = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат ЗначенияПоля;
	
КонецФункции

Функция УловиеПозицииВыполнено(ДокументПланирования, Знач Поле, ВидСравнения, Знач ПравоеЗначение)
	
	ТипДокумента  = ТипЗнч(ДокументПланирования);
	МетаДокументы = Метаданные.Документы;
	ЭтоПлатежнаяПозиция         = (ТипДокумента = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция"));
	ЭтоПозицияПоступления       = (ТипДокумента = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления"));
	ПроверятьПлатежныеПозиции   = ЭтоПлатежнаяПозиция
									ИЛИ МетаДокументы.бит_кзн_ПлатежнаяПозиция.Реквизиты.ДокументПланирования.Тип.СодержитТип(ТипДокумента);
	ПроверятьПозицииПоступления = ЭтоПозицияПоступления
									ИЛИ МетаДокументы.бит_кзн_ПозицияПоступления.Реквизиты.ДокументПланирования.Тип.СодержитТип(ТипДокумента);
	
	Если НЕ ПроверятьПлатежныеПозиции И НЕ ПроверятьПозицииПоступления Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если ПроверятьПлатежныеПозиции И ПроверятьПозицииПоступления Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПлатежныеПозиции.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыПозиции
		|ИЗ
		|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
		|ГДЕ
		|	(ПлатежныеПозиции.Ссылка = &ДокументПланирования
		|			ИЛИ ПлатежныеПозиции.ДокументПланирования = &ДокументПланирования
		|				И НЕ ПлатежныеПозиции.ПометкаУдаления)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПозицияПоступления.Ссылка
		|ИЗ
		|	Документ.бит_кзн_ПозицияПоступления КАК ПозицияПоступления
		|ГДЕ
		|	(ПозицияПоступления.Ссылка = &ДокументПланирования
		|			ИЛИ ПозицияПоступления.ДокументПланирования = &ДокументПланирования
		|				И НЕ ПозицияПоступления.ПометкаУдаления)";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДокументыПозиции.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыПозиции
		|ИЗ
		|	&ДокументыПозиции КАК ДокументыПозиции
		|ГДЕ
		|	ДокументыПозиции.ДокументПланирования = &ДокументПланирования
		|	И НЕ ДокументыПозиции.ПометкаУдаления";
		ДокументПозиции = ?(ПроверятьПлатежныеПозиции, "Документ.бит_кзн_ПлатежнаяПозиция",
							"Документ.бит_кзн_ПозицияПоступления");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументыПозиции", ДокументПозиции);
		Если ЭтоПлатежнаяПозиция ИЛИ ЭтоПозицияПоступления Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
							"ДокументыПозиции.ДокументПланирования",
							"ДокументыПозиции.Ссылка");
		КонецЕсли;
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументПланирования);
	Запрос.Выполнить();
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументыПозиции.Ссылка КАК Ссылка
	|ИЗ
	|	ДокументыПозиции КАК ДокументыПозиции
	|ГДЕ
	|	&УсловиеПроверки";
	
	Если ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.Равно
		ИЛИ ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НачинаетсяС Тогда
		ШаблонУсловия = "%1 = %2";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НеРавно
		ИЛИ ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НеНачинаетсяС Тогда
		ШаблонУсловия = "%1 <> %2";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.Больше Тогда
		ШаблонУсловия = "%1 > %2";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.Меньше Тогда
		ШаблонУсловия = "%1 < %2";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.БольшеИлиРавно Тогда
		ШаблонУсловия = "%1 >= %2";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.МеньшеИлиРавно Тогда
		ШаблонУсловия = "%1 <= %2";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.ВГруппе
		ИЛИ ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.ВГруппеИзСписка Тогда
		ШаблонУсловия = "%1 В ИЕРАРХИИ (%2)";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НЕВГруппе
		ИЛИ ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НеВГруппеИзСписка Тогда
		ШаблонУсловия = "НЕ %1 В ИЕРАРХИИ (%2)";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.Содержит Тогда
		ШаблонУсловия = "%1 ПОДОБНО %2";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НеСодержит Тогда
		ШаблонУсловия = "НЕ %1 ПОДОБНО %2";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.ВСписке Тогда
		ШаблонУсловия = "%1 В (%2)";
	ИначеЕсли ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НеВСписке Тогда
		ШаблонУсловия = "НЕ %1 В (%2)";
	КонецЕсли;
	
	ПутьКПолю = "ДокументыПозиции.Ссылка." + Поле;
	Если ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НачинаетсяС
		ИЛИ ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НеНачинаетсяС Тогда
		ШаблонПути         = "ПОДСТРОКА(%1, %2)";
		КоличествоСимволов = Формат(СтрДлина(ПравоеЗначение), "ЧГ=");
		ПутьКПолю          = СтрШаблон(ШаблонПути, ПутьКПолю, КоличествоСимволов);
	КонецЕсли;
	
	Если ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.Содержит
		ИЛИ ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.НеСодержит Тогда
		ПравоеЗначение = "%" + ПравоеЗначение + "%";
	КонецЕсли;
	
	Если ТипЗнч(ПравоеЗначение) = Тип("Строка")
		И СтрНачинаетсяС(ПравоеЗначение, "РеквизитыПозиции.") Тогда
		ПутьКПравомуЗначению = СтрЗаменить(ПравоеЗначение, "РеквизитыПозиции.", "ДокументыПозиции.Ссылка.");
		УсловиеПроверки      = СтрШаблон(ШаблонУсловия, ПутьКПолю, ПутьКПравомуЗначению);
	Иначе
		УсловиеПроверки = СтрШаблон(ШаблонУсловия, ПутьКПолю, "&ПараметрУсловия");
		Запрос.УстановитьПараметр("ПараметрУсловия", ПравоеЗначение);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПроверки", УсловиеПроверки);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Функция определяет, есть ли в позициях документа 
// планирования указанные значения указанного реквизита.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект, ДокументСсылка 
//  ИмяРеквизита - Строка
//  ТекущееЗначение - Произвольный
//
// Возвращаемое значение:
//  Результат - Строка.
//
Функция ПозицияСодержитЗначениеВГруппе(ТекущийОбъект, ИмяРеквизита, ТекущееЗначение)
	
	Если ТекущийОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТекущееЗначение"     , ТекущееЗначение);
	
	Если ТипЗнч(ТекущийОбъект) = Тип("ДанныеФормыСтруктура") Тогда
		ИмяОбъекта = ТекущийОбъект.Ссылка.Метаданные().Имя;
	Иначе
		ИмяОбъекта = ТекущийОбъект.Метаданные().Имя;
	КонецЕсли; 
	
	ТекстЗапроса = "";
	
	Если ИмяОбъекта = Метаданные.Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.Имя
		ИЛИ ИмяОбъекта = Метаданные.Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.Имя Тогда
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, Метаданные.Документы.бит_кзн_ПлатежнаяПозиция) 
			И бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, Метаданные.Документы.бит_кзн_ПозицияПоступления) Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	бит_кзн_ПлатежнаяПозиция.Ссылка
			|ИЗ
			|	Документ.бит_кзн_ПлатежнаяПозиция КАК бит_кзн_ПлатежнаяПозиция
			|ГДЕ
			|	бит_кзн_ПлатежнаяПозиция.ДокументПланирования = &ДокументПланирования
			|	И НЕ бит_кзн_ПлатежнаяПозиция.ПометкаУдаления
			|	И бит_кзн_ПлатежнаяПозиция.%1 В ИЕРАРХИИ (&ТекущееЗначение)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	бит_кзн_ПозицияПоступления.Ссылка
			|ИЗ
			|	Документ.бит_кзн_ПозицияПоступления КАК бит_кзн_ПозицияПоступления
			|ГДЕ
			|	бит_кзн_ПозицияПоступления.ДокументПланирования = &ДокументПланирования
			|	И НЕ бит_кзн_ПозицияПоступления.ПометкаУдаления
			|	И бит_кзн_ПозицияПоступления.%1 В ИЕРАРХИИ (&ТекущееЗначение)";
			
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита);
			
		Иначе	
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ИмяОбъекта = Метаданные.Документы.бит_кзн_ПлатежнаяПозиция.Имя Тогда
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, Метаданные.Документы.бит_кзн_ПлатежнаяПозиция) Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	бит_кзн_ПлатежнаяПозиция.Ссылка
			|ИЗ
			|	Документ.бит_кзн_ПлатежнаяПозиция КАК бит_кзн_ПлатежнаяПозиция
			|ГДЕ
			|	бит_кзн_ПлатежнаяПозиция.Ссылка = &ДокументПланирования
			|	И бит_кзн_ПлатежнаяПозиция.%1 В ИЕРАРХИИ (&ТекущееЗначение)";
			
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита);
			
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ИмяОбъекта = Метаданные.Документы.бит_кзн_ПозицияПоступления.Имя Тогда
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, Метаданные.Документы.бит_кзн_ПозицияПоступления) Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	бит_кзн_ПозицияПоступления.Ссылка
			|ИЗ
			|	Документ.бит_кзн_ПозицияПоступления КАК бит_кзн_ПозицияПоступления
			|ГДЕ
			|	бит_кзн_ПозицияПоступления.Ссылка = &ДокументПланирования
			|	И бит_кзн_ПозицияПоступления.%1 В ИЕРАРХИИ (&ТекущееЗначение)";
			
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита);
			
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе	
		
		ИмяПоз = ИмяПозиций(ИмяОбъекта);
		МетаПозиция = Метаданные.Документы[ИмяПоз];
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаПозиция) Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Позициии.Ссылка
			|ИЗ
			|	Документ.%1 КАК Позициии
			|ГДЕ
			|	Позициии.ДокументПланирования = &ДокументПланирования
			|	И Позициии.%2 В ИЕРАРХИИ (&ТекущееЗначение)";
			
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяПоз, ИмяРеквизита);
			
		Иначе	
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Запрос.Текст     = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

Процедура ДобавитьСтандартныйАлгоритмПроверенУтвержден(ДеревоАлгоримтов, МетаданныеОбъекта)
	
	СтрокаОбъекта = ДеревоАлгоримтов.Строки.Добавить();
	СтрокаОбъекта.ОбъектКлючВизы = МетаданныеОбъекта;
	
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "ДокументПроверен";
	СтрокаВизы = СтрокаОбъекта.Строки.Добавить();
	СтрокаВизы.ОбъектКлючВизы = "ДокументУтвержден";
	
КонецПроцедуры

// Устанавливает статус договора контрагента. 
//
// Параметры:
//  ТекущийОбъект - СправочникСсылка.
//
Процедура УстановитьСтатусДоговораПоСтатусуВизирования(ТекущийОбъект)
	
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(ТекущийОбъект.Ссылка);
	
	Если Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
				Перечисления.бит_ТипыСтатусовОбъектов.Утвержден) Тогда

		Если ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.СоглашенияСКлиентами") Тогда
			ТекущийОбъект.Статус = Перечисления.СтатусыСоглашенийСКлиентами.Действует;
		ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.СоглашенияСПоставщиками") Тогда
			ТекущийОбъект.Статус = Перечисления.СтатусыСоглашенийСПоставщиками.Действует;
		Иначе 
			ТекущийОбъект.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		КонецЕсли;
		
	ИначеЕсли Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
				Перечисления.бит_ТипыСтатусовОбъектов.Закрыт) Тогда
		
		Если ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.СоглашенияСКлиентами") Тогда
			ТекущийОбъект.Статус = Перечисления.СтатусыСоглашенийСКлиентами.Закрыто;
		ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.СоглашенияСПоставщиками") Тогда
			ТекущийОбъект.Статус = Перечисления.СтатусыСоглашенийСПоставщиками.Закрыто;
		Иначе 
			ТекущийОбъект.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Закрыт;
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.СоглашенияСКлиентами") Тогда
			ТекущийОбъект.Статус = Перечисления.СтатусыСоглашенийСКлиентами.НеСогласовано;
		ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.СоглашенияСПоставщиками") Тогда
			ТекущийОбъект.Статус = Перечисления.СтатусыСоглашенийСПоставщиками.НеСогласовано;
		Иначе 
			ТекущийОбъект.Статус = Перечисления.СтатусыДоговоровКонтрагентов.НеСогласован;
		КонецЕсли;

	КонецЕсли;
	
	ТекущийОбъект.Записать();
		
КонецПроцедуры

#КонецОбласти
